app/controllers/games_controller.rb

INSERT INTO "games" ("name", "current_player", "mode", "owner") VALUES('Terry Chisholm Game 1', 0, NULL, 'terry')
---
  def create
    @help = "New Game"
    @game = Game.new(params[:game])
    @game.owner = current_user.login
    @game.current_player = 0
    respond_to do |format|
      if @game.save

DELETE FROM "games" WHERE "id" = 1
---
  def destroy
    @game.destroy

SELECT * FROM "games" WHERE ("games"."id" = 1)
---
  def find_game
    @game = Game.find(params[:id])