app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "admin", "remember_token", "login", "email", "created_at") VALUES(NULL, '6bb50d0b4a971b43f8d6ea393decc03fb85f126c', '2009-06-25 19:10:38', 'cacb092f7ee94c8ef562bb958d786231e7523efa', NULL, 'f', NULL, 'terry', 'terry', '2009-06-25 19:10:38')